dj140/RTL8762D/src/app/silent_ota/dfu_application.c
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rcu_application.c
* @brief     rcu application implementation
* @details   rcu application implementation
* @author    ken_mei
* @date      2017-07-03
* @version   v0.1
* *********************************************************************************************************
*/
#include <trace.h>
#include <string.h>
#include <gap.h>
#include <gap_adv.h>
#include <gap_bond_le.h>
#include <profile_server.h>
#include <gap_msg.h>
#include <board.h>
#include <app_msg.h>
#include <dfu_application.h>
#include "bas.h"
#include "dis.h"
#include "os_timer.h"
#include "gap_conn_le.h"
#include "dfu_service.h"
#include "ota_service.h"
#include "rtl876x_wdg.h"
#include "dfu_flash.h"
#include "dfu_api.h"
#include "os_sched.h"
#include "patch_header_check.h"

/*============================================================================*
 *                              Macros
 *============================================================================*/
#define DIS_SYSTEM_ID_LENGTH                8
#define DIS_PNP_ID_LENGTH                   7

/*============================================================================*
 *                              external Variables
 *============================================================================*/
extern T_SERVER_ID g_bas_service_id;
extern T_SERVER_ID g_dis_service_id;
extern T_SERVER_ID g_ota_service_id;

uint16_t g_bat_vol;
uint16_t g_bas_battery_level;

/*============================================================================*
 *                              Local Variables
 *============================================================================*/
T_GAP_DEV_STATE gap_cur_state = {0, 0, 0, 0};
T_GAP_CONN_STATE gap_conn_state = GAP_CONN_STATE_DISCONNECTED;

bool g_switch_into_ota_pending = false;
static bool dfu_active_rst_pending = false;
LantencyStatus g_lantency_status = LANTENCY_OFF;

void peripheral_handle_gap_msg(T_IO_MSG  *p_gap_msg);
void dfu_service_handle_control_point_req_exit_cb_app(uint8_t opcode);

P_FUN_DFU_OPCODE_CB dfu_service_handle_control_point_req_exit_cb =
    dfu_service_handle_control_point_req_exit_cb_app;

/*============================================================================*
 *                              Functions
 *============================================================================*/

/*
 * @fn          app_handle_io_msg
 * @brief      All the application events are pre-handled in this function.
 *                All the IO MSGs are sent to this function, Then the event handling function
 *                shall be called according to the MSG type.
 *
 * @param    io_driver_msg_recv  - bee io msg data
 * @return     void
 */
void app_handle_io_msg(T_IO_MSG io_driver_msg_recv)
{
    uint16_t msg_type = io_driver_msg_recv.type;

    switch (msg_type)
    {
    case IO_MSG_TYPE_BT_STATUS:
        {
            peripheral_handle_gap_msg(&io_driver_msg_recv);
        }
        break;
    default:
        break;
    }
}

void dfu_service_handle_control_point_req_exit_cb_app(uint8_t opcode)
{
    switch (opcode)
    {
    case DFU_OPCODE_ACTIVE_IMAGE_RESET:
        {
#if OPEN_BANKSWITCH_PRESS_TEST
            if (is_ota_support_bank_switch())
            {
                uint32_t ota_addr;
                ota_addr = get_header_addr_by_img_id(OTA);
                DFU_PRINT_INFO1("DFU_OPCODE_ACTIVE_IMAGE_RESET: Bank switch erase ota_addr=0x%x", ota_addr);
                unlock_flash_bp_all();
                flash_erase_locked(FLASH_ERASE_SECTOR, ota_addr);
                lock_flash_bp();
            }
#endif
            le_disconnect(0);
            dfu_active_rst_pending = true;
        }
        break;
    default:
        break;
    }

}

/******************************************************************
 * @fn          peripheral_HandleBtDevStateChangeEvt
 * @brief      All the gaprole_States_t events are pre-handled in this function.
 *                Then the event handling function shall be called according to the newState.
 *
 * @param    newState  - new gap state
 * @return     void
 */
void periph_handle_dev_state_evt(T_GAP_DEV_STATE new_state, uint16_t cause)
{
    APP_PRINT_INFO4("periph_handle_dev_state_evt: init state %d, adv state %d, conn state %d, cause 0x%x",
                    new_state.gap_init_state, new_state.gap_adv_state,
                    new_state.gap_conn_state, cause);
    if (gap_cur_state.gap_init_state != new_state.gap_init_state)
    {
        if (new_state.gap_init_state == GAP_INIT_STATE_STACK_READY)
        {
            /*stack ready*/
            le_adv_start();
        }
    }

    if (gap_cur_state.gap_adv_state != new_state.gap_adv_state)
    {
        if (new_state.gap_adv_state == GAP_ADV_STATE_IDLE)
        {
            if (new_state.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN)
            {
                APP_PRINT_INFO0("GAP adv stoped: because connection created");
            }
            else
            {
                APP_PRINT_INFO0("GAP adv stoped");
            }
        }
        else if (new_state.gap_adv_state == GAP_ADV_STATE_ADVERTISING)
        {

            APP_PRINT_INFO0("GAP adv start");
        }
    }

    if (gap_cur_state.gap_conn_state != new_state.gap_conn_state)
    {
        APP_PRINT_INFO2("conn state: %d -> %d",
                        gap_cur_state.gap_conn_state,
                        new_state.gap_conn_state);
    }
    gap_cur_state = new_state;
}

void periph_handle_conn_state_evt(uint8_t conn_id, T_GAP_CONN_STATE new_state, uint16_t disc_cause)
{
    APP_PRINT_INFO3("periph_handle_conn_state_evt: conn_id = %d old_state = %d new_state = %d",
                    conn_id, gap_conn_state, new_state);
    switch (new_state)
    {
    case GAP_CONN_STATE_DISCONNECTED:
        {
            if ((disc_cause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE))
                && (disc_cause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE)))
            {
                APP_PRINT_ERROR1("connection lost: cause 0x%x", disc_cause);
            }

